<!-- add-pr-comment:quicksight_plan -->

# staging/quicksight Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_iam_policy.step_functions_update_tables_location_policy will be updated in-place
  ~ resource "aws_iam_policy" "step_functions_update_tables_location_policy" {
        id               = "arn:aws:iam::239043911459:policy/StepFunctionsUpdateTablesLocationPolicy"
        name             = "StepFunctionsUpdateTablesLocationPolicy"
      ~ policy           = (sensitive value)
        tags             = {}
        # (7 unchanged attributes hidden)
    }
  # aws_sfn_state_machine.athena_update_table_location will be created
  + resource "aws_sfn_state_machine" "athena_update_table_location" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Update multiple Athena tables daily with current UTC date"
              + StartAt = "GenerateDatePath"
              + States  = {
                  + GenerateDatePath = {
                      + Next   = "UpdateTables"
                      + Result = {
                          + "current_date.$" = "States.FormatDate(States.Timestamp(), 'yyyy-MM-dd')"
                          + tables           = [
                              + {
                                  + database = "notification_quicksight"
                                  + name     = "notifications"
                                },
                              + {
                                  + database = "notification_quicksight"
                                  + name     = "notification_history"
                                },
                              + {
                                  + database = "notification_quicksight"
                                  + name     = "organisation"
                                },
                              + {
                                  + database = "notification_quicksight"
                                  + name     = "services"
                                },
                              + {
                                  + database = "notification_quicksight"
                                  + name     = "templates"
                                },
                              + {
                                  + database = "notification_quicksight"
                                  + name     = "template_categories"
                                },
                            ]
                        }
                      + Type   = "Pass"
                    }
                  + UpdateTables     = {
                      + End        = true
                      + ItemsPath  = "$.tables"
                      + Iterator   = {
                          + StartAt = "RunAthenaQuery"
                          + States  = {
                              + RunAthenaQuery = {
                                  + End        = true
                                  + Parameters = {
                                      + QueryExecutionContext = {
                                          + "Database.$" = "$.database"
                                        }
                                      + "QueryString.$"       = "States.Format('ALTER TABLE {}.{} SET LOCATION \"s3://cds-data-lake-raw-production/platform/gc-notify/notification-canada-ca-production-cluster-{}/database/public.{}/1/\";', $.database, $.table_name, $.current_date, $.table_name)"
                                      + WorkGroup             = "Notification-quicksight"
                                    }
                                  + Resource   = "arn:aws:states:::athena:startQueryExecution.sync"
                                  + Type       = "Task"
                                }
                            }
                        }
                      + Parameters = {
                          + "current_date.$" = "$.current_date"
                          + "database.$"     = "$.database"
                          + "table_name.$"   = "$.name"
                        }
                      + Type       = "Map"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "AthenaUpdateTableLocation"
      + name_prefix               = (known after apply)
      + publish                   = false
      + region                    = "ca-central-1"
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::239043911459:role/step-functions-update-tables-location-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = (known after apply)
      + type                      = "STANDARD"
      + version_description       = (known after apply)
      + encryption_configuration (known after apply)
      + logging_configuration {
          + include_execution_data = true
          + level                  = "ALL"
          + log_destination        = "arn:aws:logs:ca-central-1:239043911459:log-group:/aws/stepfunctions/AthenaUpdateTableLocation"
        }
      + tracing_configuration {
          + enabled = true
        }
    }
Plan: 1 to add, 1 to change, 0 to destroy.

# --- End of Plan 1 ---